[
    {
        "name": "University of Witswatersrand",
        "category": "University",
        "city": "Braamfontein",
        "state": "South Africa",
        "address": "1 Jan Smuts Ave, Braamfontein, 2017",
        "phone": "012 420 3111",
        "hours": "8am Mon - Fri",
        "founded": "1 March 1922",
        "viceChancellor": "Zeblon Vilakazi",
        "id": 10014,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Scientia et Labore",
        "coordinates": {
            "longitude":  28.02951,
            "latitude":  -26.18067
        },
        "faculties": ["FACULTY OF COMMERCE", "FACULY OF MEDICINE", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The University of the Witwatersrand, Johannesburg, is a multi-campus South African public research university situated in the northern areas of central Johannesburg. It is more commonly known as Wits University or Wits. 1 March 1922, the University College, Johannesburg, was granted full university status after being incorporated as the University of the Witwatersrand.[8] The Johannesburg municipality donated a site in Milner Park, north-west of Braamfontein, to the new institution as its campus and construction began the same year, on 4 October. The first Chancellor of the new university was Prince Arthur of Connaught and the first Principal (a position that would be merged with that of Vice-Chancellor in 1948)[9] was Professor Jan Hofmeyr.[10] Hofmeyr set the tone of the university's subsequent opposition to apartheid when, during his inaugural address as Principal he declared, while discussing the nature of a university and its desired function in a democracy, that universities should know no distinctions of class, wealth, race or creed. True to Hofmeyr's words, from the outset Wits was an open university with a policy of non-discrimination on racial or any other grounds",
        "imageName": "wits1",
        "buildingImage": "wits2"
    },
    {
    "name": "University of Johannesburg",
    "category": "University",
    "city": "Johannesburg",
    "state": "South Africa",
    "address": "Rossmore, Johannesburg, 2092",
    "phone": "086 110 2421",
    "hours": "8am Mon - Fri",
    "founded": "1 January 2005",
    "viceChancellor": "Letlhokwa George Mpedi",
    "id": 1008,
    "isFeatured": false,
    "isFavorite": false,
    "motto": "Diens Deur Kennis",
    "coordinates": {
        "longitude": 27.9927,
        "latitude": -26.1833
    },
    "faculties": ["FACULTY OF HUMANITIES", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
    "description": "Randse Afrikaanse Universiteit (Rand Afrikaans Universitv) (1967-2004). Vibrant, multicultural and dynamic, the University of Johannesburg (UJ) shares the pace and energy of cosmopolitan Johannesburg, the city whose name it carries. Proudly South African, the university is alive down to its African roots, and well-prepared for its role in actualizing the potential that higher education holds for the continent's development. Randse Afrikaanse Universiteit (Rand Afrikaans Universitv) (1967-2004). Vibrant, multicultural and dynamic, the University of Johannesburg (UJ) shares the pace and energy of cosmopolitan Johannesburg, the city whose name it carries. Proudly South African, the university is alive down to its African roots, and well-prepared for its role in actualizing the potential that higher education holds for the continent's development. Randse Afrikaanse Universiteit (Rand Afrikaans Universitv) (1967-2004). Vibrant, multicultural and dynamic, the University of Johannesburg (UJ) shares the pace and energy of cosmopolitan Johannesburg, the city whose name it carries. Proudly South African, the university is alive down to its African roots, and well-prepared for its role in actualizing the potential that higher education holds for the continent's development.",
    "imageName": "uj2",
    "buildingImage": "uj1"
    },
    {
        "name": "Tshwane University of Technology",
        "category": "Technikon",
        "city": "Pretoria",
        "state": "South Africa",
        "address": "Staatsartillerie Rd, Pretoria West,0183",
        "phone": "086 110 2421",
        "hours": "8am Mon - Fri",
        "founded": "1 January 2004",
        "viceChancellor": "Tinyiko Maluleke",
        "id": 1001,
        "isFeatured": true,
        "isFavorite": true,
        "motto": "We Empower People",
        "coordinates": {
            "longitude": 28.1867752,
            "latitude": -25.7514531
        },
        "faculties": ["FACULTY OF HUMANITIES", "FACULY OF ICT", "FACULTY OF ENGINEERING", "FACULTY OF SCIENCE","FACULTY OF ARTS"],
        "description": "Tshwane University of Technology is a higher education institution in South Africa that came into being through a merger of three technikons - Technikon Northern Gauteng, Technikon North-West and Technikon Pretoria. Tshwane University of Technology is a higher education institution in South Africa that came into being through a merger of three technikons - Technikon Northern Gauteng, Technikon North-West and Technikon Pretoria. Tshwane University of Technology is a higher education institution in South Africa that came into being through a merger of three technikons - Technikon Northern Gauteng, Technikon North-West and Technikon Pretoria. Tshwane University of Technology is a higher education institution in South Africa that came into being through a merger of three technikons - Technikon Northern Gauteng, Technikon North-West and Technikon Pretoria.",
        "imageName": "tut2",
        "buildingImage":"tut4"
    },
    {
        "name": "University of Cape Town",
        "category": "University",
        "city": "Cape Town",
        "state": "South Africa",
        "address": "Rondebosch, Cape Town, 7700",
        "phone": "021 650 9111",
        "hours": "8am Mon - Fri",
        "founded": "1 October 1829",
        "viceChancellor": "Professor Mamokgethi Phakeng",
        "id": 1009,
        "isFeatured": false,
        "isFavorite": false,
        "motto": "Good Hope, Spes Bona",
        "coordinates": {
            "longitude": 18.46484,
            "latitude": -33.94223
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMATION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The University of Cape Town is a public research university in Cape Town, South Africa. Established in 1829 as the South African College, it was granted full university status in 1918, making it the oldest university in South Africa and the oldest university in Sub-Saharan Africa in continuous operation. The University of Cape Town is a public research university in Cape Town, South Africa. Established in 1829 as the South African College, it was granted full university status in 1918, making it the oldest university in South Africa and the oldest university in Sub-Saharan Africa in continuous operation. The University of Cape Town is a public research university in Cape Town, South Africa. Established in 1829 as the South African College, it was granted full university status in 1918, making it the oldest university in South Africa and the oldest university in Sub-Saharan Africa in continuous operation.",
        "imageName": "uct11",
        "buildingImage": "uct3"
    },
    {
        "name": "Vaal University of Technology",
        "category": "Technikon",
        "city": "Vanderbijlpark",
        "state": "South Africa",
        "address": "Andries Potgieter Blvd, Vanderbijlpark, 1900",
        "phone": "016 950 9000",
        "hours": "8am Mon - Fri",
        "founded": "1 January 1966",
        "viceChancellor": "Ntate Dan Kgwadi",
        "id": 1002,
        "isFeatured": false,
        "isFavorite": false,
        "motto": "Inspiring thought, Shaping Talent",
        "coordinates": {
            "longitude": 27.8380,
            "latitude": -26.7117,
        },
        "faculties": ["FACULTY OF HUMANITIES", "FACULY OF ICT", "FACULTY OF EDUCATION", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "Vaal University of Technology is a higher education institution in South Africa. It attracts students from all over the country. It is one of the largest residential universities of technology, with about 20 000 students, 40 programs, all primarily taught in English. The forerunner to the Vaal University of Technology was named the Vaal Triangle College for Advanced Technical Education. Situated in Vanderbijlpark in South Africa's industrial heartland, it opened to 189 students (taught by 15 members of staff ) in 1966. Growth was rapid. In 1975, new buildings – including a library, gymnasium, laboratories and lecture halls – enabled growth to continue, so that by 1978 student enrolments reached 3,000 and the staff complement 137. The following year, the Advanced Technical Education Amendment Act brought a name change – the Vaal Triangle Technikon[1] – and the opportunity for the new category of higher education institutions to offer and award National Certificates, National Diplomas, National Higher Diplomas and National Masters Diplomas. The Vaal University of Technology (VUT) is a contact institution. There were 16,146 contact students enrolled in 2007. Of the student body, 14,693 were full-time students and 1,453 part-time. Of these, 14,781 were South African citizens while 909 were from other SADC countries and 456 from non-SADC countries",
        "imageName": "vut1",
        "buildingImage":"vut2"
    },
    {
        "name": "Varsity College",
        "category": "College",
        "city": "Sandton",
        "state": "South Africa",
        "address": "Waterstone Drive, Benmore Rd, 2196",
        "phone": "011 784 6939",
        "hours": "8am Mon - Fri",
        "founded": "1 January 2004",
        "viceChancellor": "Tinyiko Maluleke",
        "id": 1004,
        "isFeatured": true,
        "isFavorite": true,
        "motto": "Creative Thinking. Critical Thinking.",
        "coordinates": {
            "longitude": 28.05068,
            "latitude": -26.0966
        },
        "faculties": ["FACULTY OF HUMANITIES", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The IIE's Varsity College is an educational brand of The Independent Institute of Education (The IIE). The IIE is the most accredited private higher education provider in SA and it is registered with the Department of Higher Education and Training. Postgraduate and undergraduate IIE degrees, diplomas, higher certificates and short learning programs are offered at The IIE's Varsity College. Focus is placed on small lecture groups, interactive lectures, and modern technology in the educational space. The IIE's Varsity College has eight campuses across South Africa, located in Cape Town, Durban (North and Westville), Pretoria, Waterfall-Midrand, Sandton, Pietermaritzburg, and Port Elizabeth. The IIE's Varsity College is an educational brand of The Independent Institute of Education (The IIE). The IIE is the most accredited private higher education provider in SA and it is registered with the Department of Higher Education and Training. Postgraduate and undergraduate IIE degrees, diplomas, higher certificates and short learning programs are offered at The IIE's Varsity College. Focus is placed on small lecture groups, interactive lectures, and modern technology in the educational space. The IIE's Varsity College has eight campuses across South Africa, located in Cape Town, Durban (North and Westville), Pretoria, Waterfall-Midrand, Sandton, Pietermaritzburg, and Port Elizabeth.",
        "imageName": "v1",
        "buildingImage":"vc2"
    },
    {
    "name": "University of South Africa",
    "category": "University",
    "city": "Pretoria",
    "state": "South Africa",
    "address": "Preller St, Muckleneuk, Pretoria, 0002",
    "phone": "012 429 3111",
    "hours": "8am Mon - Fri",
    "founded": "26 June 1873",
    "viceChancellor": "Puleng LenkaBula",
    "id": 10016,
    "isFeatured": true,
    "isFavorite": false,
    "motto": "Pro Gentibus Sapientia",
    "coordinates": {
        "longitude":  28.199104,
        "latitude":  -25.768845
    },
    "faculties": ["FACULTY OF HUMANITIES", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
    "description": "The University of South Africa, known colloquially as Unisa, is the largest university system in South Africa by enrollment. It attracts a third of all higher education students in South Africa. The University of South Africa (Unisa), the only higher education institution to carry the name of the country, is the people's university in every sense of the word. Throughout its history, spanning 15 decades, Unisa has responded to the developments brought about by changing times, the needs of a developing country and society at large, and an ever-evolving higher education environment. This was achieved through ongoing and dynamic transitioning. Unisa's journey has been one of continuous growth and transformation, aimed at shaping tomorrow through education. Unisa's roots (and indeed that of higher education in South Africa) date back to 1873 when the University of the Cape of Good Hope was founded, initially functioning as an examining body for higher education. In 1916, the university changed its name to the University of South Africa and in 1918 it relocated to Pretoria. In 1946, it became one of the first public universities in the world to teach exclusively by means of distance education. Today, Unisa is widely recognised as a leading comprehensive, open, distance and e-Learning (CODeL) university. The university has more than 370 000 students and is the largest university in South Africa and on the African continent, and one of the world's mega-universities. With offices across South Africa and students from 109 countries, Unisa has an extensive geographical footprint and global reach.",
    "imageName": "unisa1",
    "buildingImage": "uni4"
    },
    {
        "name": "Boston College",
        "category": "College",
        "city": "Randburg",
        "state": "South Africa",
        "address": "Hillview Centre 318 Oak Street",
        "phone": "011 787 6945",
        "hours": "8am Mon - Fri",
        "founded": "1991,",
        "viceChancellor": "Tinyiko Maluleke",
        "id": 1005,
        "isFeatured": false,
        "isFavorite": false,
        "motto": "Ever to Excel",
        "coordinates": {
            "longitude": 28.002004 ,
            "latitude": -26.092747
        },
        "faculties": ["FACULTY OF HUMANITIES", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "Boston City Campus has continually added courses to its offering, giving you more and more choices as to what you can study here – we have over 100 courses for you to choose from (Postgraduate, Degrees, Diplomas, Higher Certificates, Occupational courses and Short learning programmes), and cover many fields. Boston City Campus has continually added courses to its offering, giving you more and more choices as to what you can study here – we have over 100 courses for you to choose from (Postgraduate, Degrees, Diplomas, Higher Certificates, Occupational courses and Short learning programmes), and cover many fields. Boston City Campus has continually added courses to its offering, giving you more and more choices as to what you can study here – we have over 100 courses for you to choose from (Postgraduate, Degrees, Diplomas, Higher Certificates, Occupational courses and Short learning programmes), and cover many fields. Boston City Campus has continually added courses to its offering, giving you more and more choices as to what you can study here – we have over 100 courses for you to choose from (Postgraduate, Degrees, Diplomas, Higher Certificates, Occupational courses and Short learning programmes), and cover many fields",
        "imageName": "b1",
        "buildingImage":"b2"
    },
    {
        "name": "Durban University of Technology",
        "category": "Technikon",
        "city": "Durban",
        "state": "South Africa",
        "address": "41/43 M L Sultan Rd, Greyville, Durban, 4001",
        "phone": "031 373 2000",
        "hours": "8am Mon - Fri",
        "founded": "1 January 2002",
        "viceChancellor": "Thandwa Zizwe Mthembu",
        "id": 10010,
        "isFeatured": true,
        "isFavorite": true,
        "motto": "Creative. Distinctive. Impactful.",
        "coordinates": {
            "longitude": 31.0109225,
            "latitude": -29.8496191
        },
        "faculties": ["FACULTY OF ACCOUNTING & INFORMATICS", "FACULTY OF APPLIED SCIENCES", "FACULTY OF ARTS AND DESIGN", "FACULTY OF MANAGEMENT SCIENCES","FACULTY OF HEALTH SCIENCES"],
        "description": "The Durban University of Technology is a multi-campus university situated in KwaZulu-Natal, South Africa. It was formed in 2002 following the merger of Technikon Natal and ML Sultan Technikon and it was initially known as the Durban Institute of Technology. It has five campuses in Durban, and two in Pietermaritzburg. The Durban University of Technology (DUT) is a University in KwaZulu Natal, South Africa. It has five campuses in Durban, and two in Pietermaritzburg. In July 2019, approximately 33932 students were enrolled to study at DUT. The University is one of 5 technical institutions on the African continent to offer Doctoral Degrees. KwaZulu-Natal’s Indian population began arriving in the 1860s to primarily work as indentured labourers on the sugar plantations. In 1927, those with no formal educational qualifications were threatened with repatriation. This threat stimulated adult classes in literacy, as well as a range of commercial subjects, held in a mission school and a Hindu Institute, but it was not until after the Second World War, and thanks to substantial financial support from the public, that ML Sultan College came into being. It would be another decade, however, before the City Council, now preoccupied with the structures of the first Group Areas Act of 1950, allocated suitable land for a permanent campus. The Natal Technical College was founded in 1907 and immediately began providing tuition to more than 350 part-time students. The structures of apartheid as it was codified through legislation weighed heavily on this institution as well. In 1955 the college was taken over by national education authorities; and in 1967 it became an exclusively white institution. The Durban University of Technology is a result of the merger, in April 2002, of the two technikons, ML Sultan and Technikon Natal. It was named the Durban Institute of Technology and later became the Durban University of Technology in 2007",
        "imageName": "dut1",
        "buildingImage":"dut2"
    },
    {
        "name": "University of the Free State",
        "category": "University",
        "city": "Bloemfontein",
        "state": "South Africa",
        "address": "205 Nelson Mandela Dr, Park West, 9301",
        "phone": "051 401 9111",
        "hours": "8am Mon - Fri",
        "founded": "4 March 1908",
        "viceChancellor": "Francis Petersen",
        "id": 10019,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "In Deo Sapientiae Lux",
        "coordinates": {
            "longitude":  28.823281,
            "latitude":  -28.486241
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The University of the Free State is a multi-campus public university in Bloemfontein, the capital of the Free State and the judicial capital of South Africa. It was first established as an institution of higher learning in 1904 as a tertiary section of Grey College. The long-held dream of an institution of higher education in the Free State became a reality in 1904 when the Grey College first accepted matriculants for a full B.A. course. In 1906 the tertiary part of Grey College became known as the Grey University College (GUC), but shortly thereafter the school and college parted ways. In 1910, the Parliament of the Orange River Colony passed legislation declaring the GUC an official educational institution in the fields of the Arts and Sciences. In terms of the modern South African university system, the University of the Free State owes its formal emergence to the University of South Africa (UNISA), itself established as an autonomous university by legislation in 1916. UNISA, at the time, was an umbrella or federal institution with its seat in Pretoria, playing an academic trusteeship role for several colleges that eventually became autonomous universities. One of the colleges that were under UNISA's trusteeship was Grey University College, Bloemfontein. UNISA's trusteeship ended in 1949 when the Orange Free State University received a charter as a university",
        "imageName": "ufs1",
        "buildingImage": "ufs2"
    },
    {
        "name": "Richfields College",
        "category": "College",
        "city": "Braamfontein",
        "state": "South Africa",
        "address": "23 De Beer St, Braamfontein, 2000",
        "phone": "0861 321 321 ",
        "hours": "8am Mon - Fri",
        "founded": "1 January 1990",
        "viceChancellor": "Tinyiko Maluleke",
        "id": 1006,
        "isFeatured": false,
        "isFavorite": false,
        "motto": "Changes Lives",
        "coordinates": {
            "longitude": 28.03441,
            "latitude": -26.19261
        },
        "faculties": ["FACULTY OF BUSINESS AND MANGEMENT SCIENCE", "FACULY OF INFORMATION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "Richfield College's mission is to prepare new generations of leaders and critical thinkers for effective and ethical leadership, ready to act as global citizens in addressing international and national issues across cultures. Richfield is undisputedly SA's Top private IT and Business college – an evolving leading academic institution that provides accredited MBA, Honours, Degree, Diploma and Higher Certificate qualifications benchmarked against the best local and global higher education providers.Courses from these industry-leading organistions are integrated into the Richfield curriculum which helps them tap into their creative thinking and expand on what is being taught to them in more innovative ways. These courses also foster a mind-set of independence and solutions-driven thinking, through research and the application of real-life scenarios, which provides students with an in-depth understanding of the real world of IT. These courses also foster a mind-set of independence and solutions-driven thinking, through research and the application of real-life scenarios, which provides students with an in-depth understanding of the real world of IT.",
        "imageName": "r1",
        "buildingImage": "rich4"
    },
    {
        "name": "Nelson Mandela University",
        "category": "University",
        "city": "Gqeberha",
        "state": "South Africa",
        "address": "University Way, Summerstrand, Gqeberha, 6019",
        "phone": "041 504 1111",
        "hours": "8am Mon - Fri",
        "founded": "4 March 1908",
        "viceChancellor": " Sibongile Muthwa",
        "id": 10020,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Ad Destinatum Persequor",
        "coordinates": {
            "longitude":  25.6706,
            "latitude":  -34.0084
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "Nelson Mandela University and before that - the University of Port Elizabeth, the Port Elizabeth Technikon and Vista University's Port Elizabeth campus. This South African university has its main administration in the coastal city of Gqeberha. Plans for the then NMMU where first revealed in 2002, by then Minister of Education, Kader Asmal. The proposal was a part of larger plan to restructure higher education in South Africa.[2] The first step in the merger came with the incorporation of Vista PE by UPE on 2 January 2004 followed by the merger of PE Technikon and UPE on 1 January 2005. NMMU was formed in 2005 through the merger of the Port Elizabeth Technikon, and the University of Port Elizabeth.[1] In 2004, prior to the merger, UPE had taken control of the Port Elizabeth Campus of Vista University. PE Technikon had a satellite campus in George, which was also merged. The first chancellor of the university was Chief Justice Pius Langa, and Justice Ronnie Pillay was the first chairperson of Council. Rolf Stumpf was the first vice-chancellor and chief executive officer of the university, who was then succeeded by Professor Derrick Swartz on 1 January 2008. Professor Sibongile Muthwa is the current vice-chancellor after her appointment in 2017. The name of the university was formally changed from Nelson Mandela Metropolitan University to Nelson Mandela University on 20 July 2017.",
        "imageName": "nmu1",
        "buildingImage": "nmu2"
    },
    {
        "name": "Mancosa",
        "category": "College",
        "city": "Centurion",
        "state": "South Africa",
        "address": "116 Witch-Hazel Ave, Highveld Techno Park, Centurion, 0157",
        "phone": " 012 742 8450",
        "hours": "8am Mon - Fri",
        "founded": "1 January 2004",
        "viceChancellor": "Professor Ntombela ",
        "id": 10011,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Dream it, we'll take you there",
        "coordinates": {
            "longitude": 28.1935872,
            "latitude":  -26.1685248
        },
        "faculties": ["FACULTY OF BUSINESS ADMINISTRATION", "FACULY OF COMMERCE", "FACULTY OF MANAGEMENT", "FACULTY OF IT","FACULTY OF ENGINEERING"],
        "description": "MANCOSA is a distance education institution with a learning centre located in Pretoria. It is a private higher education institution, established in 1995 offering affordable and accessible higher education including undergraduate and postgraduate degrees. MANCOSA is a private higher education institution registered in terms of the Higher Education Act (Act 101 of 1997 as amended). It was established in 1995 as a post-apartheid empowerment institution offering affordable and accessible management education primarily to persons previously denied access to postgraduate education. MANCOSA programmes promote high levels of independence through innovative learning and assessment interventions. Students can expect a carefully integrated mix of lectures; access to well-designed self-study materials and online learning resources.",
        "imageName": "man1",
        "buildingImage":"man2"
    },
    {
        "name": "University of Pretoria",
        "category": "University",
        "city": "Pretoria",
        "state": "South Africa",
        "address": "cnr Lynnwood Road and Roper Street, Hatfield",
        "phone": "012 420 3111",
        "hours": "8am Mon - Fri",
        "founded": "4 March 1908",
        "viceChancellor": "Tawana Kupe",
        "id": 1007,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Ad Destinatum Persequor",
        "coordinates": {
            "longitude": 28.2321043,
            "latitude":  -25.7542559
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "Transvaal University College (1908-1930. The University of Pretoria (UP) is one of Africa's top universities and the largest contact university in South Africa. We produce socially impactful research to find solutions for the world's most pressing issues. We have a high quality of teaching and learning in the classroom, online, or in communities. We have support in place for our students to graduate on time as well-rounded, responsible citizens fully prepared for the world beyond university. Transvaal University College (1908-1930. The University of Pretoria (UP) is one of Africa's top universities and the largest contact university in South Africa. We produce socially impactful research to find solutions for the world's most pressing issues. We have a high quality of teaching and learning in the classroom, online, or in communities. We have support in place for our students to graduate on time as well-rounded, responsible citizens fully prepared for the world beyond university.",
        "imageName": "up1",
        "buildingImage": "up2"
    },
    {
        "name": "Eduvos",
        "category": "College",
        "city": "Midrand",
        "state": "South Africa",
        "address": "44 Alsatian Rd, Glen Austin AH, Midrand, 1685",
        "phone": "  011 690 1700",
        "hours": "8am Mon - Fri",
        "founded": "1 January 1979",
        "viceChancellor": "Professor Ntombela ",
        "id": 10012,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Your Education. Your Future.",
        "coordinates": {
            "longitude": 28.1935872,
            "latitude":  -26.1685248
        },
        "faculties": ["FACULTY OF HUMANITIES", "FACULY OF INFORMATION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The Eduvos - Midrand is a South African private higher education institution based in Midrand, Gauteng Province. It offers bachelor's degrees in commerce, information technology, law, social sciences, creative arts, communications and science. Eduvos offers quality affordable private higher education. We are one of South Africa’s largest independent private higher education institutions with 12 vibrant campuses across the country. Students can choose from over 27 accredited qualifications, internationally recognised in four faculties: Applied Science, Commerce & Law, Humanities and Information Technology. Experience a flexible approach to learning with the options of studying full-time, online, part-time or self-paced. Eduvos. Your Education. Your Future",
        "imageName": "edu1",
        "buildingImage":"edu2"
    },
    {
        "name": "North-West University",
        "category": "University",
        "city": "Potchefstroom",
        "state": "South Africa",
        "address": "11 Hoffman St, Potchefstroom, 2531",
        "phone": " 018 299 1111",
        "hours": "8am Mon - Fri",
        "founded": "4 March 2004",
        "viceChancellor": "Bismark Tyobeka",
        "id": 10015,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Gotlhe Go Simolola Fano",
        "coordinates": {
            "longitude":   27.1000,
            "latitude":  -26.7167
        },
        "faculties": ["FACULTY OF EDUCATION", "FACULY OF ECONOMIC AND MANAGEMENT SCIENCE", "FACULTY OF NATURAL AND AGRICULTURAL SCIENCE", "FACULTY OF HEALTH SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The North-West University is a public research university located on three campuses in Potchefstroom, Mahikeng and Vanderbijlpark in South Africa. The NWU is committed to functioning as a unitary, integrated, multi-campus university that enables equity, redress and globally competitive teaching and research across all three of our campuses. Our core activities, teaching-learning and research, are intertwined with community engagement and innovation in our eight faculties, most of which serve both distance and contact students.The NWU offers more than just an education: we offer people a place in the world. Academically, students benefit from great choice and flexibility, enabling them to fulfill their potential and start preparing for their careers.Through collaboration with other universities and institutions internationally, we are part of the global higher education community. Our internationalisation activities include student and staff exchange and cooperation in academic, research, cultural and sports matters.",
        "imageName": "nwu1",
        "buildingImage": "nwu3"
    },
    {
        "name": "St. Augustine College",
        "category": "College",
        "city": "Woodmead",
        "state": "South Africa",
        "address": "Cedarwood Office Park, Woodmead, Johannesburg, 2191",
        "phone": "011 380 9000",
        "hours": "8am Mon - Fri",
        "founded": "1 November 1997",
        "viceChancellor": "Professor Ntombela ",
        "id": 10013,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Intellige ut credas",
        "coordinates": {
            "longitude": 28.08739,
            "latitude":  -26.06615
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "St Augustine College of South Africa is a private tertiary academic institution in Johannesburg, South Africa. According to St Augustine of Hippo, the two dimensions, faith and reason, should not be separated nor opposed, but rather go forward together. St Augustine offers a full range of degrees in the humanities: from Honours through Master to Doctoral degrees. (Registration for Bachelor degrees will not be accepted until further notice.) Fields of study include Education, Applied Ethics, Peace Studies, Theology and Philosophy. In addition, the Private Tertiary Institution offers a 2-year mixed mode programme for the Higher Certificate in Biblical Studies. As St Augustine seeks to serve also those who want to study for their own enrichment or the development of their skills, a number of short, non-degree courses, workshops and public lectures for lifelong learning are available at the Private Tertiary Institution.",
        "imageName": "st.aug1",
        "buildingImage":"st.aug2"
    },
    {
        "name": "University of Kwa-Zulu Natal",
        "category": "University",
        "city": "Durban",
        "state": "South Africa",
        "address": "238 Mazisi Kunene Rd, Glenwood, Durban, 4041",
        "phone": "031 260 1111",
        "hours": "8am Mon - Fri",
        "founded": "4 March 2004",
        "viceChancellor": "Professor Nana Poku",
        "id": 10018,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Inspiring Greatness",
        "coordinates": {
            "longitude":  30.9808,
            "latitude":  -29.8675
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The University of KwaZulu-Natal is a university with five campuses in the province of KwaZulu-Natal in South Africa. It was formed on 1 January 2004 after the merger between the University of Natal and the University of Durban-Westville. The University of KwaZulu-Natal was formed on 1 January 2004 as a result of the merger between the University of Durban-Westville and the University of Natal. The new university brings together the rich histories of both the former Universities. The University of Durban-Westville was established in the 1960s as the University College for Indians on Salisbury Island in Durban Bay. Student numbers throughout the 1960s were low as a result of the Congress Alliances policy of shunning apartheid structures. This policy gave way in the 1980s to a strategy of education under protest which sought to transform apartheid institutions into sites of struggle. Student numbers grew rapidly and in 1971, the College was granted University status. The following year, the newly-named University of Durban-Westville moved into its modern campus in Westville and was a site of major anti-apartheid struggle. UDW became an autonomous institution in 1984, opening up to students of all races. Founded in 1910 as the Natal University College in Pietermaritzburg, the University of Natal was granted independent University status in 1949 owing to its rapid growth in numbers, its wide range of courses and its achievements in and opportunities for research. By that time, the NUC was already a multi-campus institution, having been extended to Durban after World War 1. The distinctive Howard College building was opened in 1931, following a donation by Mr T B Davis, whose son Howard Davis was killed during the Battle of Somme in World War I. In 1946, the government approved a Faculty of Agriculture in Pietermaritzburg and, in 1947, a Medical School for African, Indian and Coloured students in Durban.",
        "imageName": "ukzn1",
        "buildingImage": "ukzn2"
    },
    {
        "name": "University of Western Cate",
        "category": "University",
        "city": "Cape Town",
        "state": "South Africa",
        "address": "Robert Sobukwe Rd, Bellville 7535",
        "phone": "012 420 3111",
        "hours": "8am Mon - Fri",
        "founded": "4 January 1959",
        "viceChancellor": "Tyrone Pretorius",
        "id": 10017,
        "isFeatured": true,
        "isFavorite": false,
        "motto": "Respice Prospice ",
        "coordinates": {
            "longitude":  18.6216,
            "latitude":  -33.90143
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "The University of the Western Cape is a public research university in Bellville, near Cape Town, South Africa. The university was established in 1959 by the South African government as a university for Coloured people only. UWC started as a bush college, a university college without autonomy under auspices of the University of South Africa. The university offered a limited training for lower to middle level positions in schools and civil service. In the first years of its existence, a great deal of the teaching staff was white. Many of the lecturers came from the university of Stellenbosch. The language in most lectures was Afrikaans. The first rector was N.J. Sieberhagen (from 1960 until 1973). The university started as a small institution: in the first year, 166 students were enrolled and the teaching staff numbered 17. In 1970, the institution gained university status and was able to award its own degrees and diplomas. During the first 15 years, the board and staff were primarily whites, supporting the National Party and apartheid. One of the few exceptions was Adam Small, head of the philosophy department. Small was dismissed in 1973 as a consequence of his involvement in the Black Consciousness Movement.[citation needed] Apart from lecturers like Small, there were many students who were active in the struggle against apartheid, and who were loyal to the Black Consciousness Movement. Protests from students against the conservative university board and lack of participation in the university led to the appointment of the first coloured rector, Richard E. van der Ross in 1975.[citation needed] The years thereafter gave way to a more liberal atmosphere, in which the university gradually distanced itself from apartheid. In 1982, the university rejected the apartheid ideology formally in its mission statement; during the next year, the university gained the same autonomy as white universities through the University of the Western Cape Act.",
        "imageName": "uwc1",
        "buildingImage": "uwc4"
    },
    {
        "name": "Cape Pensula University of Technology",
        "category": "Technikon",
        "city": "Cape Town",
        "state": "South Africa",
        "address": "Hanover St, District Six, 7925",
        "phone": "021 959 6767",
        "hours": "8am Mon - Fri",
        "founded": "1 January 2005",
        "viceChancellor": "Chris Nhlapo",
        "id": 1003,
        "isFeatured": false,
        "isFavorite": true,
        "motto": "Creating Futures",
        "coordinates": {
            "longitude": 18.4303247,
            "latitude": -33.9296784
        },
        "faculties": ["FACULTY OF LAW", "FACULY OF INFORMSTION TECHNOLOGY", "FACULTY OF ARTS", "FACULTY OF SCIENCE","FACULTY OF ENGINEERING"],
        "description": "Cape Peninsula University of Technology (Afrikaans: Kaapse Skiereiland Universiteit van Tegnologie) is a university in Cape Town, South Africa. It is the only university of technology in the Western Cape province, and is also the largest university in the province, with over 32,000 students. Cape Peninsula University of Technology (Afrikaans: Kaapse Skiereiland Universiteit van Tegnologie) is a university in Cape Town, South Africa. It is the only university of technology in the Western Cape province, and is also the largest university in the province, with over 32,000 students. Cape Peninsula University of Technology (Afrikaans: Kaapse Skiereiland Universiteit van Tegnologie) is a university in Cape Town, South Africa. It is the only university of technology in the Western Cape province, and is also the largest university in the province, with over 32,000 students.",
        "imageName": "cp1",
        "buildingImage":"cp2"
    },
]

